OpenFOAM-v2112-AD/tutorials/multiphase/twoPhaseEulerFoam/RAS/fluidisedBed/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 -0.01)
    (0.15 0 -0.01)
    (0.15 1 -0.01)
    (0 1 -0.01)
    (0 0 0.01)
    (0.15 0 0.01)
    (0.15 1 0.01)
    (0 1 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 200 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )
    wall walls
    (
        (0 4 7 3)
        (2 6 5 1)
    )
    empty frontAndBackPlanes
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
